Revit 2027 API
ParameterTypeId.AnalyticalMemberSectionType Property
 "Section Type": The id of the type from the structural Family assigned to the analytical member.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalMemberSectionType { get; }
Public Shared ReadOnly Property AnalyticalMemberSectionType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalMemberSectionType {
	ForgeTypeId^ get ();
}
static member AnalyticalMemberSectionType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace